; domain
;; TSP PDDL ***Domain File*** 

    (define (domain tsp)
        (:requirements :typing)
        (:types node)

        ;; Define the facts in the problem
        ;; "?" denotes a variable, "-" a type
        (:predicates 
            (move ?from ?to - node)
            (at ?pos - node)
            (connected ?start ?end - node)
            (visited ?end - node)
        )

        ;; Define the action(s)
        (:action move
            :parameters (?start ?end - node)
            :precondition (and 
                (at ?start)
                (connected ?start ?end)
            )
            :effect (and 
                (at ?end)
                (visited ?end)
                (not (at ?start))
            )
        )
    )

; problem
;; TSP PDDL ***Problem File*** 

    (define (problem tsp-01)
    (:domain tsp)
    (:objects Sydney Adelade Brisbane Perth Darwin - node)

    ;; Define the initial situation
    (:init  (connected Sydney Brisbane)
            (connected Brisbane Sydney)
            (connected Adelade Sydney)
            (connected Sydney Adelade)
            (connected Adelade Perth)
            (connected Perth Adelade)
            (connected Adelade Darwin)
            (connected Darwin Adelade)
            (at Sydney)
    )
    (:goal
            (and 
                (at Sydney)
                (visited Sydney)
                (visited Adelade)
                (visited Brisbane)
                (visited Perth)
                (visited Darwin)
            )
    )
    )

; plan
1. (move sydney adelade)
   deleted: (at sydney)
   added: (at adelade) (visited adelade)
   goals met: 1 of 6
2. (move adelade darwin)
   deleted: (at adelade)
   added: (at darwin) (visited darwin)
   goals met: 2 of 6
3. (move darwin adelade)
   deleted: (at darwin)
   added: (at adelade)
   goals met: 2 of 6
4. (move adelade perth)
   deleted: (at adelade)
   added: (at perth) (visited perth)
   goals met: 3 of 6
5. (move perth adelade)
   deleted: (at perth)
   added: (at adelade)
   goals met: 3 of 6
6. (move adelade sydney)
   deleted: (at adelade)
   added: (at sydney) (visited sydney)
   goals met: 5 of 6
7. (move sydney brisbane)
   deleted: (at sydney)
   added: (at brisbane) (visited brisbane)
   goals met: 5 of 6
8. (move brisbane sydney)
   deleted: (at brisbane)
   added: (at sydney)
   goals met: 6 of 6
